# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

1. Create a new DataFrame that only includes customers who:
   - have a **low total_claim_amount** (e.g., below $1,000),
   - have a response "Yes" to the last marketing campaign.

2. Using the original Dataframe, analyze:
   - the average `monthly_premium` and/or customer lifetime value by `policy_type` and `gender` for customers who responded "Yes", and
   - compare these insights to `total_claim_amount` patterns, and discuss which segments appear most profitable or low-risk for the company.

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [1]:
import pandas as pd

In [2]:
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv"
df = pd.read_csv(url)

In [3]:
df.head()

,Unnamed: 0,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,...,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN

In [4]:
df = df.drop(columns=["Unnamed: 0"])

df.head()

,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,Income,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,48029,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,0,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,22139,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,49078,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,23675,...,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN

In [5]:
low_claim_yes = df[
    (df["Total Claim Amount"] < 1000) &
    (df["Response"] == "Yes")
].copy()

print( low_claim_yes.shape[0])
low_claim_yes.head()

1399

,Customer,State,Customer Lifetime Value,Response,Coverage,Education,Effective To Date,EmploymentStatus,Gender,Income,...,Number of Open Complaints,Number of Policies,Policy Type,Policy,Renew Offer Type,Sales Channel,Total Claim Amount,Vehicle Class,Vehicle Size,Vehicle Type
3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,49078,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
8,FM55990,California,5989.773931,Yes,Premium,College,1/19/11,Employed,M,66839,...,0.0,1,Personal Auto,Personal L1,Offer2,Branch,739.200000,Sports Car,Medsize,NaN
15,CW49887,California,4626.801093,Yes,Basic,Master,1/16/11,Employed,F,79487,...,0.0,1,Special Auto,Special L1,Offer2,Branch,547.200000,SUV,Medsize,NaN
19,NJ54277,California,3746.751625,Yes,Extended,College,2/26/11,Employed,F,41479,...,1.0,1,Personal Auto,Personal L2,Offer2,Call Center,19.575683,Two-Door Car,Large,A
27,MQ68407,Oregon,4376.363592,Yes,Premium,Bachelor,2/28/11,Employed,F,63774,...,0.0,1,Personal Auto,Personal L3,Offer2,Agent,60.036683,Four-Door Car,Medsize,NaN

In [6]:

df_yes = df[df["Response"] == "Yes"].copy()


agg_yes = (
    df_yes
    .groupby(["Policy Type", "Gender"], as_index=False)
    .agg({
        "Monthly Premium Auto": "mean",
        "Customer Lifetime Value": "mean",
        "Total Claim Amount": "mean"
    })
)


agg_yes[["Monthly Premium Auto", "Customer Lifetime Value", "Total Claim Amount"]] = (
    agg_yes[["Monthly Premium Auto", "Customer Lifetime Value", "Total Claim Amount"]]
    .round(2)
)


agg_yes

,Policy Type,Gender,Monthly Premium Auto,Customer Lifetime Value,Total Claim Amount
0,Corporate Auto,F,94.30,7712.63,433.74
1,Corporate Auto,M,92.19,7944.47,408.58
2,Personal Auto,F,99.00,8339.79,452.97
3,Personal Auto,M,91.09,7448.38,457.01
4,Special Auto,F,92.31,7691.58,453.28
5,Special Auto,M,86.34,8247.09,429.53

In [7]:

customers_by_state = (
    df.groupby("State", as_index=False)
      .agg({"Customer": "count"})
      .rename(columns={"Customer": "Num_Customers"})
      .sort_values("Num_Customers", ascending=False)
)

display(customers_by_state)


big_states = customers_by_state[customers_by_state["Num_Customers"] > 500]


big_states

        State  Num_Customers
1  California           3552
3      Oregon           2909
0     Arizona           1937
2      Nevada            993
4  Washington            888

        State  Num_Customers
1  California           3552
3      Oregon           2909
0     Arizona           1937
2      Nevada            993
4  Washington            888

In [8]:
clv_stats = (
    df.groupby(["Education", "Gender"])["Customer Lifetime Value"]
      .agg(["max", "min", "median"])
      .round(2)
      .reset_index()
)


clv_stats

              Education Gender       max      min   median
0              Bachelor      F  73225.96  1904.00  5640.51
1              Bachelor      M  67907.27  1898.01  5548.03
2               College      F  61850.19  1898.68  5623.61
3               College      M  61134.68  1918.12  6005.85
4                Doctor      F  44856.11  2395.57  5332.46
5                Doctor      M  32677.34  2267.60  5577.67
6  High School or Below      F  55277.45  2144.92  6039.55
7  High School or Below      M  83325.38  1940.98  6286.73
8                Master      F  51016.07  2417.78  5729.86
9                Master      M  50568.26  2272.31  5579.10

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [11]:
df["Effective To Date"] = pd.to_datetime(df["Effective To Date"], format="%m/%d/%y")
df["Month"] = df["Effective To Date"].dt.month_name()

month_order = ["January", "February", "March", "April", "May", "June",
               "July", "August", "September", "October", "November", "December"]
df["Month"] = pd.Categorical(df["Month"], month_order, ordered=True)

In [12]:

policies_by_state_month = (
    df.groupby(["State", "Month"], as_index=False, observed=False)["Number of Policies"]
      .sum()
      .rename(columns={"Number of Policies": "Policies_Sold"})
)

pivot_state_month = (
    policies_by_state_month
      .pivot(index="State", columns="Month", values="Policies_Sold")
      .fillna(0)
      .astype(int)
)

pivot_state_month

Month,January,February,March,April,May,June,July,August,September,October,November,December
State,,,,,,,,,,,,
Arizona,3052,2864,0,0,0,0,0,0,0,0,0,0
California,5673,4929,0,0,0,0,0,0,0,0,0,0
Nevada,1493,1278,0,0,0,0,0,0,0,0,0,0
Oregon,4697,3969,0,0,0,0,0,0,0,0,0,0
Washington,1358,1225,0,0,0,0,0,0,0,0,0,0

In [13]:

total_policies_by_state = (
    policies_by_state_month.groupby("State")["Policies_Sold"]
    .sum()
    .sort_values(ascending=False)
)


display(total_policies_by_state.head(10))


top3_states = total_policies_by_state.head(3).index.tolist()
print(top3_states)


top3_policies = policies_by_state_month[
    policies_by_state_month["State"].isin(top3_states)
]


pivot_top3 = (
    top3_policies
    .pivot(index="State", columns="Month", values="Policies_Sold")
    .fillna(0)
    .astype(int)
)

pivot_top3

State
California    10602
Oregon         8666
Arizona        5916
Nevada         2771
Washington     2583
Name: Policies_Sold, dtype: int64

['California', 'Oregon', 'Arizona']

Month,January,February,March,April,May,June,July,August,September,October,November,December
State,,,,,,,,,,,,
Arizona,3052,2864,0,0,0,0,0,0,0,0,0,0
California,5673,4929,0,0,0,0,0,0,0,0,0,0
Oregon,4697,3969,0,0,0,0,0,0,0,0,0,0

In [14]:

df["Response_Flag"] = (df["Response"] == "Yes").astype(int)


response_rate = (
    df.groupby("Sales Channel")["Response_Flag"]
    .mean()
    .mul(100)            
    .round(2)
    .rename("Response Rate (%)")
    .reset_index()
    .sort_values("Response Rate (%)", ascending=False)
)


response_rate

  Sales Channel  Response Rate (%)
0         Agent              18.01
3           Web              10.89
1        Branch              10.79
2   Call Center              10.32